cask_args appdir: '/Applications'

tap "goles/battery"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"

# brew "ack"
brew "bat"
brew "cocoapods"
brew "coreutils"
brew "ctags", link: false
brew "fzf"
brew "gibo"
brew "git"
# brew "glib"
brew "goles/battery/battery"
# brew "graphviz"
brew "grc"
# brew "hub"
# brew "imagemagick"
brew "vips"
brew "libgit2"
# brew "macvim", link: false
brew "mas"
brew "nvm"
# brew "openssl@1.1"
brew "postgresql@16", restart_service: true
# brew "python"
brew "ruby-build"
brew "rbenv"
brew "rbenv-ctags"
# brew "rbenv-default-gems"
# brew "re2"
# brew "readline"
brew "redis", restart_service: true
brew "rg"
brew "spaceman-diff"
brew "spark"
# brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "vim"
brew "wget"
brew "yarn", link: false
brew "yt-dlp"
brew "z"
brew "heroku"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Casks
cask "alfred"
cask "android-studio"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
# cask "evernote"
# cask "firefox"
cask "slack"
# cask "spectacle"
# cask "tunnelblick"
cask "vlc"
cask "cursor"

# MacOs Apps that are not listed in casks

mas "Amphetamine", id: 937984704
mas "Pocket", id: 568494494
# mas "Xcode", id: 497799835
